Repository: singulay-tech/Codelume
Catalog: CodeLume/Localizable.xcstrings
Source language: en
Languages: zh_hans

source: • Format: .mp4 or .mov
zh_hans: • 格式：.mp4 或 .mov

source: • Max size: 50 MB
zh_hans: • 大小：不超过 50 MB

source: • Min resolution: 1080P (4K recommended)
zh_hans: • 分辨率：不低于 1080P（推荐 4K）

source: • Must support seamless looping
zh_hans: • 支持无缝循环播放

source: About
zh_hans: 关于

source: All contact methods are listed at the bottom of this page.
zh_hans: 所有联系方式都列在本页面底部。

source: All Screens
zh_hans: 所有屏幕

source: App Store Version
zh_hans: App Store 版本

source: Available Screens:
zh_hans: 可用屏幕：

source: Browse
zh_hans: 浏览

source: Built with a privacy-first approach, Codelume runs inside the macOS sandbox and does not collect personal data. It is open source, transparent, and built for long-term reliability.
zh_hans: 码镜秉持隐私优先原则，运行于 macOS 沙盒环境内，不收集个人数据。应用开源透明，并以长期稳定可靠为目标构建。

source: Cancel
zh_hans: 取消

source: Cannot Delete
zh_hans: 无法删除

source: Category
zh_hans: 种类

source: Chinese
zh_hans: 中文

source: Close
zh_hans: 关闭

source: Codec
zh_hans: 编码格式

source: Codelume
zh_hans: 码镜

source: Codelume focuses on the playback engine and desktop integration. You can use your own compatible video wallpapers, and we encourage proper licensing and respect for original creators.
zh_hans: 码镜专注于播放引擎与桌面集成能力。你可以使用自己的兼容视频壁纸，我们鼓励遵守授权规范并尊重原创作者。

source: Codelume focuses on the playback engine—we don't create wallpaper content. Wallpaper quality determines the ceiling of the entire experience. If you have original wallpapers, you can submit them via email for other users to purchase. Pricing is decided by the original creator. Codelume takes a small share to cover server maintenance and development; the rest goes to the creator. Of course, there will always be free wallpapers available.
zh_hans: 码镜专注于播放引擎的开发，不涉及壁纸内容创作。壁纸质量决定了动态壁纸体验的上限。如果你有优质的原创壁纸，可以通过邮箱投递，供其他用户购买使用。价格由原创作者决定。码镜仅收取少部分费用用于服务器维护与日常开发，其余部分结算给原创作者。当然，也会提供大量免费壁纸供大家使用。

source: Codelume is a dynamic wallpaper application designed exclusively for macOS, featuring a sleek design with comprehensive functionality. As a menu bar application, please remember to launch and use it from the menu bar—it won't be visible in your Dock.
zh_hans: 码镜是一款专为 macOS 设计的动态壁纸，界面简洁，功能全面。它是一款菜单栏应用，请从菜单栏中启动并使用，不会显示在程序坞中。

source: Codelume is a native macOS dynamic wallpaper app designed for smooth playback, low resource usage, and a polished desktop experience.
zh_hans: 码镜是一款原生 macOS 动态壁纸应用，专注于流畅播放、低资源占用和精致的桌面体验。

source: Codelume is a native, open-source dynamic wallpaper application built exclusively for macOS.
zh_hans: 码镜是一款原生开源动态壁纸应用，专为 macOS 系统设计。

source: Codelume is Running
zh_hans: 码镜正在运行中

source: Codelume offers a dedicated screen saver module that allows users to set their current dynamic wallpapers as screen savers after downloading and installing it. This creates a seamless visual transition between active desktop environments and idle states, extending dynamic aesthetics throughout the entire device usage cycle while ensuring privacy security and maintaining a consistent immersive visual experience.
zh_hans: 为此码镜提供了专属的屏幕保护程序模块，用户下载安装后即可将正在使用的动态壁纸设置为屏幕保护程序，实现桌面环境与休息状态的无缝视觉衔接，让动态美学贯穿设备使用的全周期，在保护隐私安全的同时营造始终如一的沉浸式视觉体验。

source: Codelume Screen Saver
zh_hans: 码镜屏保

source: Completely free. Clone, build, and customize from GitHub.
zh_hans: 完全免费。可从 GitHub 克隆、构建和自定义。

source: Compose Message
zh_hans: 撰写邮件

source: Conditions for pausing playback
zh_hans: 暂停/播放条件

source: Connected
zh_hans: 已连接

source: Contact & Support
zh_hans: 联系与支持

source: Contact Information
zh_hans: 联系方式

source: Contact via Email
zh_hans: 通过电子邮件联系

source: Copy Email Address
zh_hans: 复制邮箱地址

source: Created At
zh_hans: 创建时间

source: Dark
zh_hans: 深色

source: Delete
zh_hans: 删除

source: Delete Configuration
zh_hans: 删除配置

source: Delete this video?
zh_hans: 删除视频？

source: Details
zh_hans: 详情

source: Display on all available screens
zh_hans: 在所有可用屏幕上显示

source: Douyin
zh_hans: 抖音

source: Download Screen Saver
zh_hans: 下载屏保

source: Due to limited testing resources, this app is only tested on the latest macOS systems. Older systems may experience compatibility issues. We recommend upgrading your system or compiling from source to resolve any issues.
zh_hans: 由于精力有限，本软件只在最新的 macOS 系统上进行测试。较旧的系统可能存在兼容性问题。建议升级系统或通过源码编译来解决问题。

source: Duration
zh_hans: 时长

source: Email
zh_hans: 邮箱

source: Email Support
zh_hans: 邮件支持

source: English
zh_hans: 英语

source: Enter file path
zh_hans: 输入文件路径

source: File Path
zh_hans: 文件路径

source: File Path:
zh_hans: 文件路径：

source: File Size
zh_hans: 文件大小

source: FileName
zh_hans: 文件名称

source: Five minutes
zh_hans: 五分钟

source: Follow system
zh_hans: 跟随系统

source: Follow us for updates, demos, and community content.
zh_hans: 关注我们以获取更新、演示和社区内容。

source: For technical support, collaboration inquiries, or feedback.
zh_hans: 如需技术支持、合作咨询或提供反馈，请联系我们。

source: From the list on the left, select a screen to view and edit its configuration information
zh_hans: 从左侧列表中选择一个屏幕，查看和编辑其配置信息

source: General Settings
zh_hans: 通用设置

source: Get Codelume
zh_hans: 获取码镜

source: Get Started
zh_hans: 开始使用

source: GitHub Open-Source Version
zh_hans: GitHub 开源版本

source: Half an hour
zh_hans: 半小时

source: Home
zh_hans: 主界面

source: Import Completed
zh_hans: 导入完成

source: Import Failed
zh_hans: 导入失败

source: Import Successful
zh_hans: 导入成功

source: Import Wallpapers
zh_hans: 导入壁纸

source: Integrated with Supabase services, offering both free and paid wallpapers with a richer and continuously expanding content ecosystem.
zh_hans: 接入 Supabase 服务，提供免费与付费壁纸，内容生态更丰富且持续扩展。

source: Language settings:
zh_hans: 语言设置

source: Later
zh_hans: 稍后

source: Light
zh_hans: 浅色

source: Loading...
zh_hans: 加载中…

source: LocalWallpaper
zh_hans: 本地壁纸

source: Loop
zh_hans: 循环

source: Made with ♥ for the macOS
zh_hans: 倾心为 macOS 打造

source: Main
zh_hans: 主

source: Main Screen
zh_hans: 主屏幕

source: Main Screen:
zh_hans: 主屏幕：

source: Mute
zh_hans: 静音

source: Muted
zh_hans: 静音

source: New Password
zh_hans: 新密码

source: New wallpapers, version updates, and technical insights.
zh_hans: 壁纸上新、版本更新和技术分享。

source: No
zh_hans: 否

source: Non-program-built-in local video cannot be recovered after deletion and need to be redownloaded or imported.
zh_hans: 非程序内置的本地视频删除后无法恢复，需重新下载或导入。

source: Note: Paid features are currently in development. All wallpapers are available for free at this time.
zh_hans: 注：付费功能还在开发中，暂时所有壁纸免费使用。

source: OK
zh_hans: 确定

source: One day
zh_hans: 一天

source: One hour
zh_hans: 一小时

source: One minute
zh_hans: 一分钟

source: One month
zh_hans: 一个月

source: One week
zh_hans: 一周

source: Open in Mail
zh_hans: 在邮件中打开

source: Open Source Version
zh_hans: 开源版本

source: Paid download to support Apple Developer Program costs. Auto-updated.
zh_hans: 付费下载以支持苹果开发者计划费用。自动更新。

source: Password
zh_hans: 密码

source: Pause
zh_hans: 暂停

source: Pause the playback when in battery-powered mode
zh_hans: 当处于电池供电模式时暂停播放

source: Pause the playback when in power-saving mode
zh_hans: 当处于省电模式时暂停播放

source: Pause the playback when the app is in full-screen mode
zh_hans: 运行全屏应用时暂停播放

source: Pause the playback when there are other apps on the desktop
zh_hans: 桌面有其他应用时暂停播放

source: Physical Resolution:
zh_hans: 物理分辨率：

source: Play
zh_hans: 播放

source: Playback Controls
zh_hans: 播放控制

source: Playback operations
zh_hans: 播放设置

source: Playback Settings
zh_hans: 播放设置

source: Playback Settings:
zh_hans: 播放设置：

source: Playback Status:
zh_hans: 播放状态：

source: Playback Type
zh_hans: 播放类型

source: Playback Type:
zh_hans: 播放类型：

source: Playing
zh_hans: 播放

source: Please confirm your password
zh_hans: 请确认您的密码

source: Please restart the app to apply the new language settings.
zh_hans: 请重启应用程序以应用新的语言设置

source: Please select a screen to configure
zh_hans: 请选择一个屏幕进行配置

source: Preferences
zh_hans: 偏好设置

source: Preview
zh_hans: 预览

source: Quit
zh_hans: 退出

source: Random
zh_hans: 随机

source: Register
zh_hans: 注册

source: Report issues, request features, or contribute code.
zh_hans: 报告问题、请求功能或贡献代码。

source: Reset Configuration
zh_hans: 重置配置

source: Resolution
zh_hans: 分辨率

source: Resolution:
zh_hans: 分辨率：

source: Restart Now
zh_hans: 现在重启

source: Restart Required
zh_hans: 重启请求

source: Rstart
zh_hans: 重启

source: Save
zh_hans: 保存

source: Save Screen Saver
zh_hans: 保存屏保

source: Screen %@
zh_hans: 屏幕 %@

source: Screen ID:
zh_hans: 屏幕 ID：

source: Screen Information
zh_hans: 屏幕信息

source: Screen Management
zh_hans: 屏幕管理

source: Screen Saver
zh_hans: 屏保程序

source: Screen Saver Introduction
zh_hans: 屏幕保护程序介绍

source: Screen savers originated in the CRT monitor era, primarily designed to prevent 'burn-in' caused by static images remaining on the screen for extended periods. This phenomenon occurs when electron beams continuously bombard the same phosphor areas, causing permanent physical damage. As technology evolved to LCD and OLED displays, screen savers transformed from mere hardware protection to versatile platforms that integrate security, energy management, information display, and personalized experiences.
zh_hans: 屏幕保护程序最初诞生于CRT显示器时代，其核心目的是通过动态画面防止静态图像长时间停留导致的"烧屏"现象，即避免电子束持续轰击相同荧光粉区域造成永久性物理损伤。随着技术演进至LCD、OLED时代，屏幕保护的作用已从单纯的硬件保护转变为集安全防护、能源管理、信息展示与个性化体验于一体的多功能平台。

source: Screen Statistics
zh_hans: 屏幕统计信息

source: Screen Status:
zh_hans: 屏幕状态：

source: ScreenManager
zh_hans: 管理屏幕

source: Screensaver Saved
zh_hans: 屏保已保存

source: Screensaver saved successfully!
zh_hans: 屏保保存成功!

source: Secondary Screen
zh_hans: 副屏幕

source: Select Screen
zh_hans: 选择屏幕

source: Select Wallpaper Files
zh_hans: 选择壁纸文件

source: Sequence
zh_hans: 顺序

source: Show on next startup
zh_hans: 下次启动时显示

source: Show welcome screen at startup
zh_hans: 启动时显示欢迎界面

source: Sign in
zh_hans: 登录

source: Sign in to access the Wallpaper Hub.
zh_hans: 登录后访问壁纸中心

source: Some materials are sourced from the internet. If any content infringes on your rights, please contact us using the contact methods at the bottom of this page.
zh_hans: 部分素材来源于网络。如有侵权，请通过本页面底部的联系方式与我们联系。

source: Start at login
zh_hans: 开机自启

source: Subject
zh_hans: 主题

source: Submission Requirements:
zh_hans: 投递要求：

source: Submit wallpapers or report copyright issues.
zh_hans: 投递壁纸或举报版权问题。

# Successfully imported %d wallpaper(s), failed %d:
source: Successfully imported %1$d wallpaper(s), failed %2$d:
zh_hans: 成功导入 %1$d 张壁纸，失败 %2$d 张：

source: Successfully imported %d wallpaper(s).
zh_hans: 成功导入 %d 张壁纸

source: Support Email
zh_hans: 支持邮箱

source: Supports custom builds and full code-level customization. This version does not connect to the server, so Wallpaper Hub content is unavailable.
zh_hans: 支持自定义构建与代码级深度定制。该版本不接入服务器，因此无法访问壁纸中心内容。

source: Tags
zh_hans: 标签

source: Ten minutes
zh_hans: 十分钟

source: The app runs strictly within the macOS sandbox, requires no network permissions, and never collects user data.
zh_hans: 该应用严格运行于 macOS 沙盒环境内，无需任何网络权限，且绝不会收集用户数据。

source: The application is already running. Please access Codelume through the top status bar.
zh_hans: 该应用已在运行。请通过顶部状态栏访问码镜

source: Theme settings:
zh_hans: 主题设置

source: This video is currently being used by a screen and cannot be deleted.
zh_hans: 该视频正在被某个屏幕使用，无法删除。

source: Title
zh_hans: 标题

source: Total Screens
zh_hans: 总屏幕数

source: Unset wallpaper bundle
zh_hans: 未设置壁纸资源包

source: Update Configuration
zh_hans: 更新配置

source: Use your Apple account to sign in
zh_hans: 使用你的 Apple 账号登录

source: Username
zh_hans: 用户名

source: Version %@
zh_hans: 版本%@

source: Versions
zh_hans: 版本介绍

source: Video
zh_hans: 视频

source: View installation instructions on GitHub.
zh_hans: 在 GitHub上查看安装说明。

source: View on App Store
zh_hans: 在 App Store 上查看

source: View on GitHub
zh_hans: 在 GitHub 上查看

source: Visit Codelume's Douyin
zh_hans: 访问 Codelume 的抖音

source: Volume
zh_hans: 音量

source: Volume:
zh_hans: 音量：

source: Wallpaper bundle:
zh_hans: 壁纸资源包：

source: Wallpaper Configuration
zh_hans: 壁纸配置

source: Wallpaper Content
zh_hans: 壁纸内容

source: Wallpaper Hub
zh_hans: 壁纸中心

source: We focus solely on the playback engine. For video wallpapers, we recommend using compatible content from platforms like **Wallpaper Engine**. We welcome collaboration with original creators.
zh_hans: 我们仅专注于播放引擎功能。对于视频壁纸，我们建议您使用来自诸如 **Wallpaper Engine** 等平台的兼容内容。我们欢迎与原创作者进行合作。

source: We typically respond within 1-2 business days.
zh_hans: 我们通常在1-2个工作日内回复。

source: Yes
zh_hans: 是

source: Your message will open in your default email client.
zh_hans: 您的邮件将在默认的邮件客户端中打开。
